{
    "title": "Sand accumulators to aid downhole pump operations",
    "fig_desc": "FIGS. 1A and 1B are schematic diagrams showing a section view of a sand accumulator using a double sleeve design during a production phase and during an ESP shutdown phase, respectively, according to one or more embodiments of the disclosure",
    "all_fig_descs": [
        "FIGS. 1A and 1B are schematic diagrams showing a section view of a sand accumulator using a double sleeve design during a production phase and during an ESP shutdown phase, respectively, according to one or more embodiments of the disclosure",
        "FIGS. 1A and 1B depict schematic diagrams showing section views of a sand accumulator 100 using a double sleeve design during a production phase and during an ESP shutdown phase, respectively, according to one or more embodiments of the disclosure",
        "As shown in FIGS. 1A and 1B, sand accumulator 100 may be disposed in line with a wellbore tubular 145 (shown as 145a and 145b)",
        " The outer sleeve 150 and the inner sleeve 160 as shown in FIGS. 1A and 1B are generally cylindrical (that is, a hollow cylinder) in shape",
        "In some embodiment, such as shown in FIGS. 1A and 1B, the large flow ports 190a, 190b may be angled upward (that is, uphole) and also deviated, in other words angled, from a central axis of the insert 105 or housing 130",
        "Referring to FIGS. 1A and 1B together, the operation of the accumulator 100 will now be described",
        "As shown in FIGS. 1A and 1B, the spring 140 may compress during production of downhole fluids to allow fluid to flow uphole through the sand accumulator 100"
    ],
    "component_labels": [
        "first cap",
        "extended spring",
        "arrows",
        "uphole",
        "base",
        "spring",
        "other solids",
        "insert",
        "seal",
        "particles",
        "inner cavity",
        "cap",
        "flow",
        "sand",
        "housing",
        "inner sleeve",
        "rupture disk",
        "accumulator",
        "sand accumulator",
        "flange",
        "second cap",
        "fluid flow",
        "hosing",
        "outer sleeve",
        "flows",
        "inner and outer sleeves",
        "vortex flow",
        "annulus",
        "tool housing",
        "uphole surface",
        "head",
        "sleeve",
        "stationary outer sleeve",
        "downhole surface"
    ]
}