{
    "title": "ELECTRONIC CIGARETTE CARTRIDGE TUBE AND METHOD FOR PREPARING THE SAME",
    "fig_desc": "  Fig. 4A depicts another schematically cross-sectional diagram of consistent production machines allocated in a pulp-molding production line, according to a second preferred embodiment of the present invention, wherein the pulp-molding production line is configurable to prepare a cartridge container of the electronic cigarette cartridge tube",
    "all_fig_descs": [
        "  Fig. 4A depicts another schematically cross-sectional diagram of consistent production machines allocated in a pulp-molding production line, according to a second preferred embodiment of the present invention, wherein the pulp-molding production line is configurable to prepare a cartridge container of the electronic cigarette cartridge tube",
        " |EPO DP num=\"13\"|CA 3065441 2019-12-17  Fig. 4B depicts a partially-enlarged cross-sectional view according to a circled region C2 shown in Fig. 4A",
        "  Fig. 4C depicts a flowchart of a method for preparing the electronic cigarette cartridge tube, according to the pulp-molding production line shown in Fig. 4A",
        "  Fig. 5A depicts a perspective diagram of the cartridge container of the electronic cigarette cartridge tube, which is prepared by the pulp-molding production line shown in Fig. 4A",
        "  Further referring to Figs. 4A and 4B, Fig. 4A depicts a schematically cross-sectional diagram of consistent production machines of a pulp-molding production line 70 according to a second preferred embodiment of the present invention, and Fig. 4A depicts a partially-enlarged cross-sectional view according to a circled region C2 shown in Fig. 4B depicts illustrated in Fig. 4B depicts the pulp-molding production line 70 can be manipulated on massively-and-automatically producing a cartridge container 76 (as shown in Fig. 4B depicts the electronic cigarette cartridge tube",
        "  Further referring to Figs. 4A-40, Fig. 4C depicts a flowchart of a method for preparing the electronic cigarette cartridge tube, in accordance with the pulp- molding production line shown in Fig. 4C depicts the method for preparing the electronic cigarette cartridge tube as illustrated in Fig. 4A. Since used with consistent production machines of the pulp-molding production line 70 in the second embodiment, a variety of component structures and their components functions used in the method for preparing the electronic cigarette cartridge tube all can refer to the above- introduced embodiments illustrated in Fig. 4A. Since and 4A-4B",
        "  Further referring to Figs. 4A-4B and 5A-5B, Fig. 5A depicts a perspective diagram of the cartridge container 76 which is integrally formed by a preparation CA 3065441 2019-12-17 according to the pulp-molding production line 70 shown in Fig. 5A depicts depicts a laterally cross-sectional view taken along a sectioning plane B-B of the cartridge container 76 shown in Fig. 4A, and 5B implementing the cutting step 300 (see Fig. 4A, and 5B an integral structure of the cartridge container 76 is formed as illustrated in Fig. 4A, and 5B wherein the cartridge container 76 is further formed with a second longitudinal center line y2 parallel to the respective corresponding longitudinally- elongated center line Y2, a top distal end 764 formed perpendicular to the second longitudinal center line y2, a top opening 7642 formed on the top distal end 764, a bottom distal end 762 formed opposed to the top distal end 764 and perpendicular to the second longitudinal center line y2, a bottom opening 7622 formed on the bottom distal end 762, and a longitudinal outermost wall surface 760 located between both the top distal end 764 and the bottom distal end 762"
    ],
    "component_labels": [
        "elongated center line",
        "cartridge container",
        "second top distal end",
        "top opening",
        "opening",
        "entire cartridge container",
        "longitudinal outermost wall surface",
        "second top opening",
        "second bottom distal end",
        "top distal end",
        "bottom distal end",
        "second longitudinal center line",
        "sectioning plane",
        "venting aperture",
        "surface"
    ]
}